Revit 2025 API
Zone.HeatingAirTemperature Property
Get or set the Heating Air Temperature of the Zone.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public double HeatingAirTemperature { get; set; }
Public Property HeatingAirTemperature As Double
	Get
	Set
public:
property double HeatingAirTemperature {
	double get ();
	void set (double value);
}
member HeatingAirTemperature : float with get, set
Property Value
Double
Remarks
This property is used to get or set the Heating Air Temperature of the Zone.
See Also
Reference
Zone Class
Autodesk.Revit.DB.Mechanical Namespace